7767517
153 190
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_0              1 2 in1 2 3
Convolution              convrelu_0               1 1 in0 4 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=720 9=1
Split                    splitncnn_1              1 2 4 5 6
Convolution              convrelu_1               1 1 6 7 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900 9=1
Convolution              conv_49                  1 1 7 8 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900
BinaryOp                 add_0                    2 1 8 5 9 0=0
Split                    splitncnn_2              1 2 9 10 11
Convolution              convrelu_2               1 1 11 12 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900 9=1
Convolution              conv_51                  1 1 12 13 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900
BinaryOp                 add_1                    2 1 13 10 14 0=0
Split                    splitncnn_3              1 2 14 15 16
Convolution              convrelu_3               1 1 16 17 0=20 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1800 9=1
Split                    splitncnn_4              1 2 17 18 19
Convolution              convrelu_4               1 1 19 20 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600 9=1
Convolution              conv_54                  1 1 20 21 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600
BinaryOp                 add_2                    2 1 21 18 22 0=0
Split                    splitncnn_5              1 2 22 23 24
Convolution              convrelu_5               1 1 24 25 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600 9=1
Convolution              conv_56                  1 1 25 26 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600
BinaryOp                 add_3                    2 1 26 23 27 0=0
Split                    splitncnn_6              1 2 27 28 29
Convolution              convrelu_6               1 1 29 30 0=40 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=7200 9=1
Split                    splitncnn_7              1 2 30 31 32
Convolution              convrelu_7               1 1 32 33 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_59                  1 1 33 34 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_4                    2 1 34 31 35 0=0
Split                    splitncnn_8              1 2 35 36 37
Convolution              convrelu_8               1 1 37 38 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_61                  1 1 38 39 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_5                    2 1 39 36 40 0=0
Split                    splitncnn_9              1 2 40 41 42
Convolution              convrelu_9               1 1 42 43 0=40 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=14400 9=1
Split                    splitncnn_10             1 2 43 44 45
Convolution              convrelu_10              1 1 45 46 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_64                  1 1 46 47 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_6                    2 1 47 44 48 0=0
Split                    splitncnn_11             1 2 48 49 50
Convolution              convrelu_11              1 1 50 51 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_66                  1 1 51 52 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_7                    2 1 52 49 53 0=0
Split                    splitncnn_12             1 2 53 54 55
Convolution              convrelu_12              1 1 55 56 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_68                  1 1 56 57 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_8                    2 1 57 54 58 0=0
Split                    splitncnn_13             1 2 58 59 60
Convolution              convrelu_13              1 1 60 61 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_70                  1 1 61 62 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_9                    2 1 62 59 63 0=0
Convolution              convrelu_14              1 1 3 64 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=360 9=1
Split                    splitncnn_14             1 2 64 65 66
Convolution              convrelu_15              1 1 66 67 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900 9=1
Convolution              conv_73                  1 1 67 68 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900
BinaryOp                 add_10                   2 1 68 65 69 0=0
Split                    splitncnn_15             1 2 69 70 71
Convolution              convrelu_16              1 1 71 72 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900 9=1
Convolution              conv_75                  1 1 72 73 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900
BinaryOp                 add_11                   2 1 73 70 74 0=0
Split                    splitncnn_16             1 2 74 75 76
Convolution              convrelu_17              1 1 76 77 0=20 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1800 9=1
Split                    splitncnn_17             1 2 77 78 79
Convolution              convrelu_18              1 1 79 80 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600 9=1
Convolution              conv_78                  1 1 80 81 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600
BinaryOp                 add_12                   2 1 81 78 82 0=0
Split                    splitncnn_18             1 2 82 83 84
Convolution              convrelu_19              1 1 84 85 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600 9=1
Convolution              conv_80                  1 1 85 86 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600
BinaryOp                 add_13                   2 1 86 83 87 0=0
Split                    splitncnn_19             1 2 87 88 89
Convolution              convrelu_20              1 1 89 90 0=40 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=7200 9=1
Split                    splitncnn_20             1 2 90 91 92
Convolution              convrelu_21              1 1 92 93 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_83                  1 1 93 94 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_14                   2 1 94 91 95 0=0
Split                    splitncnn_21             1 2 95 96 97
Convolution              convrelu_22              1 1 97 98 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_85                  1 1 98 99 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_15                   2 1 99 96 100 0=0
Split                    splitncnn_22             1 2 100 101 102
Convolution              convrelu_23              1 1 102 103 0=40 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=14400 9=1
Split                    splitncnn_23             1 2 103 104 105
Convolution              convrelu_24              1 1 105 106 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_88                  1 1 106 107 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_16                   2 1 107 104 108 0=0
Split                    splitncnn_24             1 2 108 109 110
Convolution              convrelu_25              1 1 110 111 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_90                  1 1 111 112 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_17                   2 1 112 109 113 0=0
Split                    splitncnn_25             1 2 113 114 115
Convolution              convrelu_26              1 1 115 116 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_92                  1 1 116 117 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_18                   2 1 117 114 118 0=0
Split                    splitncnn_26             1 2 118 119 120
Convolution              convrelu_27              1 1 120 121 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_94                  1 1 121 122 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_19                   2 1 122 119 123 0=0
Concat                   cat_0                    2 1 63 123 124 0=0
Convolution              convrelu_28              1 1 124 125 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3200 9=1
Split                    splitncnn_27             1 2 125 126 127
Convolution              convrelu_29              1 1 127 128 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_97                  1 1 128 129 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_20                   2 1 129 126 130 0=0
Split                    splitncnn_28             1 2 130 131 132
Convolution              convrelu_30              1 1 132 133 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_99                  1 1 133 134 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_21                   2 1 134 131 135 0=0
Split                    splitncnn_29             1 2 135 136 137
Convolution              convrelu_31              1 1 137 138 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_101                 1 1 138 139 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_22                   2 1 139 136 140 0=0
Split                    splitncnn_30             1 2 140 141 142
Convolution              convrelu_32              1 1 142 143 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400 9=1
Convolution              conv_103                 1 1 143 144 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=14400
BinaryOp                 add_23                   2 1 144 141 145 0=0
PixelShuffle             pixel_shuffle_0          1 1 145 146 0=2 1=0
Concat                   cat_1                    3 1 146 41 101 147 0=0
Convolution              convrelu_33              1 1 147 148 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=16200 9=1
Split                    splitncnn_31             1 2 148 149 150
Convolution              convrelu_34              1 1 150 151 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600 9=1
Convolution              conv_106                 1 1 151 152 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600
BinaryOp                 add_24                   2 1 152 149 153 0=0
Split                    splitncnn_32             1 2 153 154 155
Convolution              convrelu_35              1 1 155 156 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600 9=1
Convolution              conv_108                 1 1 156 157 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3600
BinaryOp                 add_25                   2 1 157 154 158 0=0
PixelShuffle             pixel_shuffle_1          1 1 158 159 0=2 1=0
Concat                   cat_2                    3 1 159 28 88 160 0=0
Convolution              convrelu_36              1 1 160 161 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4860 9=1
Split                    splitncnn_33             1 2 161 162 163
Convolution              convrelu_37              1 1 163 164 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 9=1
Convolution              conv_111                 1 1 164 165 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296
BinaryOp                 add_26                   2 1 165 162 166 0=0
Split                    splitncnn_34             1 2 166 167 168
Convolution              convrelu_38              1 1 168 169 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 9=1
Convolution              conv_113                 1 1 169 170 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296
BinaryOp                 add_27                   2 1 170 167 171 0=0
PixelShuffle             pixel_shuffle_2          1 1 171 172 0=2 1=0
Concat                   cat_3                    3 1 172 15 75 173 0=0
Convolution              convrelu_39              1 1 173 174 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2070 9=1
Split                    splitncnn_35             1 2 174 175 176
Convolution              convrelu_40              1 1 176 177 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900 9=1
Convolution              conv_116                 1 1 177 178 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900
BinaryOp                 add_28                   2 1 178 175 179 0=0
Split                    splitncnn_36             1 2 179 180 181
Convolution              convrelu_41              1 1 181 182 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900 9=1
Convolution              conv_118                 1 1 182 183 0=10 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=900
BinaryOp                 add_29                   2 1 183 180 184 0=0
Convolution              conv_119                 1 1 184 185 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1080
PixelShuffle             pixel_shuffle_3          1 1 185 186 0=2 1=0
Convolution              conv_120                 1 1 2 187 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=48
PixelShuffle             pixel_shuffle_4          1 1 187 188 0=2 1=0
BinaryOp                 add_30                   2 1 188 186 out0 0=0
