7767517
78 88
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=8 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 1 2 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72 7=8 9=1
Convolution              conv_38                  1 1 2 3 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32
Convolution              convrelu_1               1 1 3 4 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 4 5 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24 9=1
Convolution              conv_40                  1 1 5 6 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=144
Split                    splitncnn_0              1 2 6 7 8
Convolution              convrelu_2               1 1 8 9 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=216 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 9 10 0=36 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=324 7=36 9=1
Convolution              conv_42                  1 1 10 11 0=6 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=216
BinaryOp                 add_0                    2 1 7 11 12 0=0
Convolution              convrelu_3               1 1 12 13 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=216 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 13 14 0=36 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=324 7=36 9=1
Convolution              conv_44                  1 1 14 15 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=288
Split                    splitncnn_1              1 2 15 16 17
Convolution              convrelu_4               1 1 17 18 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 18 19 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=1
Convolution              conv_46                  1 1 19 20 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
BinaryOp                 add_1                    2 1 16 20 21 0=0
Split                    splitncnn_2              1 2 21 22 23
Convolution              convrelu_5               1 1 23 24 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 24 25 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=1
Convolution              conv_48                  1 1 25 26 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
BinaryOp                 add_2                    2 1 22 26 27 0=0
Convolution              convrelu_6               1 1 27 28 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384 9=1
ConvolutionDepthWise     convdwrelu_6             1 1 28 29 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48 9=1
Convolution              conv_50                  1 1 29 30 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=768
Split                    splitncnn_3              1 2 30 31 32
Convolution              convrelu_7               1 1 32 33 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
ConvolutionDepthWise     convdwrelu_7             1 1 33 34 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              conv_52                  1 1 34 35 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
BinaryOp                 add_3                    2 1 31 35 36 0=0
Split                    splitncnn_4              1 2 36 37 38
Convolution              convrelu_8               1 1 38 39 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
ConvolutionDepthWise     convdwrelu_8             1 1 39 40 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              conv_54                  1 1 40 41 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
BinaryOp                 add_4                    2 1 37 41 42 0=0
Split                    splitncnn_5              1 2 42 43 44
Convolution              convrelu_9               1 1 44 45 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
ConvolutionDepthWise     convdwrelu_9             1 1 45 46 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              conv_56                  1 1 46 47 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
BinaryOp                 add_5                    2 1 43 47 48 0=0
Convolution              convrelu_10              1 1 48 49 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 49 50 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              conv_58                  1 1 50 51 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Split                    splitncnn_6              1 2 51 52 53
Convolution              convrelu_11              1 1 53 54 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=1
ConvolutionDepthWise     convdwrelu_11            1 1 54 55 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 7=144 9=1
Convolution              conv_60                  1 1 55 56 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
BinaryOp                 add_6                    2 1 52 56 57 0=0
Split                    splitncnn_7              1 2 57 58 59
Convolution              convrelu_12              1 1 59 60 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=1
ConvolutionDepthWise     convdwrelu_12            1 1 60 61 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1296 7=144 9=1
Convolution              conv_62                  1 1 61 62 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
BinaryOp                 add_7                    2 1 58 62 63 0=0
Convolution              convrelu_13              1 1 63 64 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456 9=1
ConvolutionDepthWise     convdwrelu_13            1 1 64 65 0=144 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1296 7=144 9=1
Convolution              conv_64                  1 1 65 66 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5760
Split                    splitncnn_8              1 2 66 67 68
Convolution              convrelu_14              1 1 68 69 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600 9=1
ConvolutionDepthWise     convdwrelu_14            1 1 69 70 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2160 7=240 9=1
Convolution              conv_66                  1 1 70 71 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
BinaryOp                 add_8                    2 1 67 71 72 0=0
Split                    splitncnn_9              1 2 72 73 74
Convolution              convrelu_15              1 1 74 75 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600 9=1
ConvolutionDepthWise     convdwrelu_15            1 1 75 76 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2160 7=240 9=1
Convolution              conv_68                  1 1 76 77 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
BinaryOp                 add_9                    2 1 73 77 78 0=0
Convolution              convrelu_16              1 1 78 79 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600 9=1
ConvolutionDepthWise     convdwrelu_16            1 1 79 80 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2160 7=240 9=1
Convolution              conv_70                  1 1 80 81 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=19200
Convolution              convrelu_17              1 1 81 82 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400 9=1
Pooling                  avgpool2d_0              1 1 82 83 0=1 1=3 11=3 12=1 13=0 2=1 3=0 5=1 6=0
Reshape                  reshape_75               1 1 83 84 0=1280
InnerProduct             fcrelu_0                 1 1 84 85 0=128 1=1 -23310=1,0.32433629 2=163840 9=2
InnerProduct             linear_74                1 1 85 86 0=3 1=1 2=384
Softmax                  softmax_36               1 1 86 out0 0=0 1=1
